app/controllers/comments_controller.rb

    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(comment_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Ваня"], ["body", "Это круто!"], ["post_id", 4], ["created_at", "2019-11-18 16:47:57.918086"], ["updated_at", "2019-11-18 16:47:57.918086"]]