app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Мой первый пост"], ["body", "Это текст первой статьи "], ["created_at", "2019-11-18 16:44:54.993900"], ["updated_at", "2019-11-18 16:44:54.993900"]]
---
    def create
        #render plain:  params[:post].inspect
        @post = Post.new(post_params)

        if(@post.save)